//=================================================================================================
/**
 *  @file   StaticActor.h
 *  @brief  当たられる側アクター
 *  @author yy-ikeuchi@gamefreak.co.jp
 *  @date   2015.02.17
 */
//=================================================================================================
#include "ViewerProc/include/FieldStatic/Collision/BaseActor.h"
#include "ViewerProc/include/FieldStatic/Collision/StaticActor.h"

// RTTIデバッグシステム
///#include "../../include/RttiDebug/RttiManager.h"

//----------------------------------------------------------------------------------------
//! @brief 当たられる側アクター
//----------------------------------------------------------------------------------------

//-----------------------------------------------------------------------------
/**
*  @brief  コンストラクタ
*/
//-----------------------------------------------------------------------------
StaticActor::StaticActor()
{
}

//-----------------------------------------------------------------------------
/**
*  @brief  デストラクタ
*/
//-----------------------------------------------------------------------------
StaticActor::~StaticActor()
{
}

//-----------------------------------------------------------------------------
/**
*  @brief  RTTIマネージャーに自身のプロパティを登録
*/
//-----------------------------------------------------------------------------
void StaticActor::RegistRtti(void)
{
#if USE_RTTI_DEBUG

  // この記述がなければ親のメンバ変数はエディタに登録されません
  RTTI_BASE_PARENT(StaticActor,BaseActor);

  BaseActor::RegistRtti();

#endif
}
