//==============================================================================
/**
 * @file	JFPoint.h
 * @brief	ジョインフェスタモデル設置ポイント
 * @author	ichiraku_katsuhiko
 * @date	2015/05/28 15:59:28
 */
// =============================================================================

#ifndef __JF_POINT_H__
#define __JF_POINT_H__
#pragma once

#include <macro/include/gfl2_macros.h>
#include <math/include/gfl2_Vector3.h>

#include "NetApp/JoinFesta/include/JoinFestaDefine.h"
// パーソナルデータ
#include "NetStatic/NetAppLib/include/JoinFesta/JoinFestaPersonalData.h"

GFL_NAMESPACE_BEGIN(NetApp)
GFL_NAMESPACE_BEGIN(JoinFesta)

//-----------------------------------------------------------------------------
//-----------------------------------------------------------------------------

class JFPoint
{
  GFL_FORBID_COPY_AND_ASSIGN(JFPoint);
public:

  //-----------------------------------------------------------------------------
  /**
   *  定数
   */
  //-----------------------------------------------------------------------------
  /// インデックス値の無効値
  static const u32 INDEX_NULL = 999;

  //-----------------------------------------------------------------------------
  //-----------------------------------------------------------------------------


public:
  // コンストラクタ
  JFPoint();
  // デストラクタ
  virtual ~JFPoint();

  //=============================================================================
  /**
   *  publicメソッド
   */
  //=============================================================================
  //------------------------------------------------------------------
  /**
   * @brief   ポイントのインデックスを設定
   * @param   [in]index インデックス値
   */
  //------------------------------------------------------------------
  void SetPointIndex( const u32 index );

  //------------------------------------------------------------------
  /**
   * @brief   ポイントのインデックスを取得
   * @return  インデックス値
   */
  //------------------------------------------------------------------
   u32 GetPointIndex() const;

  //------------------------------------------------------------------
  /**
   * @brief   ポイントの座標を設定
   * @param   [in]pos 座標
   */
  //------------------------------------------------------------------
  void SetPointPosition( const gfl2::math::Vector3 pos );

  //------------------------------------------------------------------
  /**
   * @brief   ポイントの座標を取得
   * @return  座標
   */
  //------------------------------------------------------------------
   gfl2::math::Vector3 GetPointPosition() const;

  //------------------------------------------------------------------
  /**
   * @brief   モデル表示中か
   * @retval  true:表示中 
   * @retval  false:表示していない 
   */
  //------------------------------------------------------------------
  bool IsModelView();

  //------------------------------------------------------------------
  /**
   * @brief   モデル表示中に設定
   */
  //------------------------------------------------------------------
  void ModelViewOn();

  //------------------------------------------------------------------
  /**
   * @brief   モデル非表示中に設定
   */
  //------------------------------------------------------------------
  void ModelViewOff();

  //------------------------------------------------------------------
  /**
   * @brief   パーソナルデータを設定
   * @param   [in]pPersonal パーソナルデータのポインタ
   */
  //------------------------------------------------------------------
  void SetPersonalData( NetAppLib::JoinFesta::JoinFestaPersonalData* pPersonal );

  //------------------------------------------------------------------
  /**
   * @brief   パーソナルデータを取得
   * @return  personal パーソナルデータ
   */
  //------------------------------------------------------------------
  NetAppLib::JoinFesta::JoinFestaPersonalData* GetPersonalData();

  //------------------------------------------------------------------
  /**
   * @brief   パーソナルデータがセットされているか
   * @return  trueでセットされている
   */
  //------------------------------------------------------------------
  bool IsSetPersonalData() const;
  
  //=============================================================================
  /**
   *  privateメソッド
   */
  //=============================================================================

private:
  u32                   m_index;        ///< インデックス
  gfl2::math::Vector3   m_point;        ///< ポイント座標
  bool                  m_isModelView;  ///< モデル表示されているかフラグ
  //
  NetAppLib::JoinFesta::JoinFestaPersonalData*  m_pPersonalData;        //!< ポイントに対するパーソナルデータ
  bool                                          m_isSetPersonalData;    //!< パーソナルデータがセットされているか
};

GFL_NAMESPACE_END(JoinFesta)
GFL_NAMESPACE_END(NetApp)

#endif // __JF_POINT_H__
