// ============================================================================
/*
 * @file gfl2_QRYUVImageInfo.h
 * @brief QRコードのYUV422形式のイメージ情報です。
 * @date 2015.03.05
 */
// ============================================================================
#if !defined( GFL2_QRYUVIMAGEINFO_H_INCLUDE )
#define GFL2_QRYUVIMAGEINFO_H_INCLUDE
#pragma once

#include <macro/include/gfl2_Macros.h>
#include <types/include/gfl2_Typedef.h>
#include <heap/include/gfl2_Heap.h>


GFL_NAMESPACE_BEGIN(gfl2)
GFL_NAMESPACE_BEGIN(qr)


class QRYUVImageInfo
{
  GFL_FORBID_COPY_AND_ASSIGN( QRYUVImageInfo );
public:
  // --------------------------------------------------------------------------
  /**
   * @brief  YUVイメージデータを格納するバッファを作成します。
   * @param  pDeviceHeap バッファを確保する為のデバイスヒープです。
   * @param  bufferSize バッファのサイズです。byteサイズを指定します。
   */
  // --------------------------------------------------------------------------
  QRYUVImageInfo( gfl2::heap::HeapBase* pDeviceHeap, u32 bufferSize );

  // --------------------------------------------------------------------------
  /**
   * @brief  YUVイメージデータを格納するバッファを削除します。
   */
  // --------------------------------------------------------------------------
  virtual~QRYUVImageInfo();
  
  // --------------------------------------------------------------------------
  /**
   * @brief  YUVイメージデータをバッファにコピーします。
   * @param  pImage YUVイメージデータ
   * @param  imageSize YUVイメージデータのサイズ
   */
  // --------------------------------------------------------------------------
  void CopyImage( const u8* pImage, u32 imageSize );

  // --------------------------------------------------------------------------
  /**
   * @brief  YUVイメージの幅を設定します。
   * @param  width YUVイメージの幅
   */
  // --------------------------------------------------------------------------
  void SetWidth( u16 width );

  // --------------------------------------------------------------------------
  /**
   * @brief  YUVイメージの高さを設定します。
   * @param  height YUVイメージの高さ
   */
  // --------------------------------------------------------------------------
  void SetHeight( u16 height );

  // --------------------------------------------------------------------------
  /**
   * @brief  YUVイメージデータを取得します。
   * @return YUVイメージデータ
   */
  // --------------------------------------------------------------------------
  u8* GetYUVImageBuffer() const;

  // --------------------------------------------------------------------------
  /**
   * @brief  YUVイメージの幅を取得します。
   * @return YUVイメージの幅
   */
  // --------------------------------------------------------------------------
  u16 GetWidth() const;

  // --------------------------------------------------------------------------
  /**
   * @brief  YUVイメージの高さを取得します。
   * @return YUVイメージの高さ
   */
  // --------------------------------------------------------------------------
  u16 GetHeight() const;

private:
  u8*     m_pBuffer;
  u32     m_BufferSize;
  u16     m_Width;
  u16     m_Height;

};


GFL_NAMESPACE_END(qr)
GFL_NAMESPACE_END(gfl2)

#endif // GFL2_QRYUVIMAGEINFO_H_INCLUDE
