//=================================================================================================
/**
 *  @file   BaseSolver.h
 *  @brief  ソルバーベース
 *  @author yy-ikeuchi@gamefreak.co.jp
 *  @date   2015.02.17
 */
//=================================================================================================
#include "Field/FieldRo/include/Collision/BaseSolver.h"

//----------------------------------------------------------------------------------------
//! @brief ソルバーベース
//----------------------------------------------------------------------------------------

// 頑健性のために余分に押し返す量
const f32 BaseSolver::MARJIN = 0.5f;

//-----------------------------------------------------------------------------
/**
*  @brief  コンストラクタ
*/
//-----------------------------------------------------------------------------
BaseSolver::BaseSolver()
{
}

//-----------------------------------------------------------------------------
/**
*  @brief  デストラクタ
*/
//-----------------------------------------------------------------------------
BaseSolver::~BaseSolver()
{
}

//-----------------------------------------------------------------------------
/**
*  @brief  ツリー間の衝突を解決
*
*  @param  pRootStaticActorRoot  衝突されるツリー
*  @param  pRootStaticActorRoot  衝突するツリー
*/
//-----------------------------------------------------------------------------
void BaseSolver::Solved(gfl2::renderingengine::scenegraph::instance::InstanceNode* pRootStaticActorRoot,
                        gfl2::renderingengine::scenegraph::instance::InstanceNode* pRootDynamicActorRoot)
{
}

//----------------------------------------------------------------------------
/**
*  @brief  引数のツリーに登録されているメッシュ形状を軽量化し保持する
*
*  @param  pActorRoot    軽量化対象のツリー
*  @param  pos           ポリゴンを収集する中心値
*  @param  collectionR   ポリゴンを収集する範囲
*/
//-----------------------------------------------------------------------------
void BaseSolver::MeshCooking(gfl2::renderingengine::scenegraph::instance::InstanceNode* pActorRoot,gfl2::math::Vector3 pos,f32 collectionR)
{
}