//=================================================================================================
/**
 *  @file   DynamicActor.h
 *  @brief  当たる側アクター
 *  @author yy-ikeuchi@gamefreak.co.jp
 *  @date   2015.02.17
 */
//=================================================================================================
#include "Field/FieldRo/include/Collision/BaseActor.h"
#include "Field/FieldRo/include/Collision/DynamicActor.h"

// RTTIデバッグシステム
#include "Field/FieldRo/include/RttiDebug/RttiManager.h"

//----------------------------------------------------------------------------------------
//! @brief 当たる側アクターベース
//----------------------------------------------------------------------------------------

//-----------------------------------------------------------------------------
/**
*  @brief  コンストラクタ
*/
//-----------------------------------------------------------------------------
DynamicActor::DynamicActor()
: m_isUseCookingData(true)
, m_isUseAdjustVector(true)
{
}

//-----------------------------------------------------------------------------
/**
*  @brief  デストラクタ
*/
//-----------------------------------------------------------------------------
DynamicActor::~DynamicActor()
{
}

//-----------------------------------------------------------------------------
/**
*  @brief  RTTIマネージャーに自身のプロパティを登録
*/
//-----------------------------------------------------------------------------
void DynamicActor::RegistRtti(void)
{
#if USE_RTTI_DEBUG

  // この記述がなければ親のメンバ変数はエディタに登録されません
  RTTI_BASE_PARENT(DynamicActor,BaseActor);

  BaseActor::RegistRtti();

#endif
}