// -------------------------------------------------------------
// 頂点プログラムからフラグメントプログラムに渡すデータ
// -------------------------------------------------------------
in vec4 outUv;
in vec4 outColor;

uniform sampler2D Texture;//テクスチャユニット

// ------------------------------------------------------------
// フラグメントシェーダプログラム
// ------------------------------------------------------------
void main (void)
{
	gl_FragColor = texture( Texture, outUv.xy );

	//gl_FragColor *= outColor;
	//gl_FragColor = outColor;
}
