//======================================================================
/**
 * @file  NexHttpResponse.h
 *
 * @author h.suzuki
 */
//======================================================================
#if defined(GF_PLATFORM_CTR)
#ifndef __NETAPP_NEX_HTTP_RESPONSE_H__
#define __NETAPP_NEX_HTTP_RESPONSE_H__

#include <nex.h>
#include <macro/include/gfl2_Macros.h>
#include <types/include/gfl2_Typedef.h>
#include <debug/include/gfl2_DebugPrint.h>
#include <heap/include/gfl2_Heap.h>


GFL_NAMESPACE_BEGIN(NetLib)
GFL_NAMESPACE_BEGIN(HTTP)


//--------------------------------------------------------------------------------------------
/**
 * @brief NEX拡張HTTPライブラリ用レスポンスデータ管理クラス。<p>
 *
 * @note 本クラスはレスポンスデータ管理のみを行います
 *       NexHttpClientのレスポンスデータ用クラスとして内部生成されます。
 */
//--------------------------------------------------------------------------------------------
class NexHttpResponse
{
public:
  //--------------------------------------------------------------------------------------------
  /**
   * @brief コンストラクタ
   */
  //--------------------------------------------------------------------------------------------
   NexHttpResponse( void );

   //--------------------------------------------------------------------------------------------
   /**
    * @brief デストラクタ
    */
   //--------------------------------------------------------------------------------------------
   virtual ~NexHttpResponse();

public:
   //--------------------------------------------------------------------------------------------
   /**
   * @brief HTTPステータスコードを取得
   *
   * @return HTTPステータスコード
   */
   //--------------------------------------------------------------------------------------------
   nn::nex::qInt GetStatusCode() const;

   //--------------------------------------------------------------------------------------------
   /**
   * @brief HTTPレスポンスバッファを取得
   *
   * @return HTTPレスポンスバッファ
   */
   //--------------------------------------------------------------------------------------------
   const nn::nex::qVector<nn::nex::qByte>& GetReceiveBuffer() const;

   //--------------------------------------------------------------------------------------------
   /**
   * @brief HTTPレスポンスバッファをクリアする
   */
   //--------------------------------------------------------------------------------------------
   void ResetReceiveBuffer();

protected:
   nn::nex::qVector<nn::nex::qByte>* m_receivedBuffer;   //!< HTTPレスポンスバッファ
   nn::nex::qInt                     m_statusCode;       //!< HTTPステータスコード
};


GFL_NAMESPACE_END(nex)
GFL_NAMESPACE_END(netapp)



#endif  // __NETAPP_NEX_HTTP_RESPONSE_H__
#endif