uniform sampler2D Texture[3];//テクスチャユニット

// -------------------------------------------------------------
// 頂点プログラムからフラグメントプログラムに渡すデータ
// -------------------------------------------------------------
varying vec4 outUv;

// -------------------------------------------------------------
// グローバル変数
// -------------------------------------------------------------
uniform bool cPsFillAlpha;

// ------------------------------------------------------------
// フラグメントシェーダプログラム
// ------------------------------------------------------------
void main (void)
{
	gl_FragColor = texture2D( Texture[0], outUv.xy );

	if ( cPsFillAlpha )
		gl_FragColor.xyz = gl_FragColor.www;

}
