//[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[
/**
 *	GAME FREAK inc.
 *
 *	@file		GameFrameMode.h
 *	@brief  フレームモード
 *	@author	tomoya takahashi
 *	@date		2011.05.18
 *
 */
//]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]
#ifndef __GAMEFRAMEMODE_H__
#define __GAMEFRAMEMODE_H__

#pragma once

namespace GameSys {

//-----------------------------------------------------------------------------
/**
 *					定数宣言
*/
//-----------------------------------------------------------------------------

  //-----------------------------------------------------------------------------
  /**
   *    GameManager内部が1/60と1/30どちらで処理を動かすか。
   */
  //-----------------------------------------------------------------------------
  //! フレームモード
  enum FrameMode {
    FRAMEMODE_60,   ///< 1/60動作モード
    FRAMEMODE_30,   ///< 1/30動作モード
    FRAMEMODE_MAX,   ///< システム内部で使用

    FRAMEMODE_DEFAULT = FRAMEMODE_30,   ///< 初期状態
  };



} //namespace GameSys 


#endif	// __GAMEFRAMEMODE_H__

