//=============================================================================
/**
 * @file    TrainerPassGamedata.cpp
 * @brief   トレーナーパス画面 ゲーム中に保持し続けるデータ
 * @author  Hiroyuki Nakamura
 * @date    2015.11.10
 */
//=============================================================================

// module
#include "App/AppEvent/include/TrainerPass/TrainerPassGamedata.h"


GFL_NAMESPACE_BEGIN(App)
GFL_NAMESPACE_BEGIN(TrainerPass)

//-----------------------------------------------------------------------------
/**
 * @brief   コンストラクタ
 */
//-----------------------------------------------------------------------------
PlayData::PlayData(void)
  : m_stampPage( 0 )
{
}

//-----------------------------------------------------------------------------
/**
 * @brief   デストラクタ
 */
//-----------------------------------------------------------------------------
PlayData::~PlayData()
{
}

//-----------------------------------------------------------------------------
/**
 * @func    GetStampPage
 * @brief   スタンプページ番号取得
 * @date    2015.11.10
 *
 * @return  スタンプページ番号
 */
//-----------------------------------------------------------------------------
s32 PlayData::GetStampPage(void)
{
  return m_stampPage;
}

//-----------------------------------------------------------------------------
/**
 * @func    SetStampPage
 * @brief   スタンプページ番号セット
 * @date    2015.11.10
 *
 * @param   スタンプページ番号
 */
//-----------------------------------------------------------------------------
void PlayData::SetStampPage( s32 page )
{
  m_stampPage = page;
}


GFL_NAMESPACE_END(TrainerPass)
GFL_NAMESPACE_END(App)
