//==============================================================================
/**
 * @file    ResortDrawListener.h
 * @brief    描画からファンクションへリスナー
 * @author  k.ohno
 * @date    February 18, 2015
 */
// =============================================================================

#if !defined( __RESORT_DRAW_LISTENER_H__ )
#define  __RESORT_DRAW_LISTENER_H__
#pragma once

GFL_NAMESPACE_BEGIN( App )
GFL_NAMESPACE_BEGIN( Resort )

class ResortDrawListener {


public:

  //--------------------------------------------------------------------------
  /**
   * @brief   ボタン押下通知
   */
  //--------------------------------------------------------------------------
  virtual void OnButtonAction( int button_no ) = 0;

  //--------------------------------------------------------------------------
  /**
   * @brief   キー操作通知
   * @param    dir  キー方向
   * @retval  true = 操作実行
   * @retval  false = 操作失敗
   */
  //--------------------------------------------------------------------------
  virtual bool OnKeyAction( u32 dir ){ return false; }



  //--------------------------------------------------------------------------
  /**
   * @brief   リゾートの終了通知
   */
  //--------------------------------------------------------------------------
  virtual void OnEndResort( void ) = 0;

  //--------------------------------------------------------------------------
  /**
   * @brief   リゾートの変更
   * @param   dir   移動方向(0: 左、1: 右)
   */
  //--------------------------------------------------------------------------
  virtual bool FeedResort( u8 dir ) = 0;

  //--------------------------------------------------------------------------
  /**
   * @brief   管理人メニューを開く
   */
  //--------------------------------------------------------------------------
  virtual void OpenHomeMenu( void ) = 0;


  //--------------------------------------------------------------------------
  /**
   * @brief   きのみをうえる
   * @param   fieldIdx    はたけインデックス
   */
  //--------------------------------------------------------------------------
  virtual void PlantKinomi( u8 fieldIdx, int itemkind ) = 0;


public: //!< 上画面の更新
  //--------------------------------------------------------------------------
  /**
   * @brief   上画面への反映
   */
  //--------------------------------------------------------------------------
  virtual void UpdateUpper( u8 resortID = 5 ) = 0;
};

GFL_NAMESPACE_END( Resort )
GFL_NAMESPACE_END( App )

#endif  /* __RESORT_DRAW_LISTENER_H__ */
