//[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[
/**
 *	GAME FREAK inc.
 *
 *	@file		gfl2_EffectResource.h
 *	@brief  エフェクトリソースクラス
 *	@author	tomoya takahashi
 *	@date		2015.03.02
 *
 */
//]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]
#if !defined( __GFL2_EFFECT_RESOURCE_H__ )
#define __GFL2_EFFECT_RESOURCE_H__
#pragma once

#include <nw/eft/eft_Resource.h>

GFL_NAMESPACE_BEGIN( gfl2 )
GFL_NAMESPACE_BEGIN( Effect )


//-----------------------------------------------------------------------------
/**
 *					定数宣言
*/
//-----------------------------------------------------------------------------

//-----------------------------------------------------------------------------
/**
 *					構造体宣言
*/
//-----------------------------------------------------------------------------

//-----------------------------------------------------------------------------
/**
 *					クラス宣言
*/
//-----------------------------------------------------------------------------
/**
 *  @brief リソースクラス再定義
 *
 *  Handleから先の詳細な操作はNW_Cafe NW_CTRの物を使用
 */
typedef nw::eft::Resource Resource;

GFL_NAMESPACE_END( Effect )
GFL_NAMESPACE_END( gfl2 )

#endif	// __GFL2_EFFECT_RESOURCE_H__

