//============================================================================================
/**
 * @file   JoinFestaAttractionListener.h
 *
 * @brief  アトラクション用リスナー
 *
 * @author 
 */
//============================================================================================
#ifndef __JOIN_FESTA_ATTRACTION_LISTENER_H__
#define __JOIN_FESTA_ATTRACTION_LISTENER_H__
#pragma once


namespace NetAppLib {
namespace JoinFesta {

class JoinFestaPersonalData;

/**
 * @brief  アトラクション用リスナ
 */
class JoinFestaAttractionListener
{
public:

  //------------------------------------------------------------------
  /**
   * @brief アトラクション参加成功
   * @param[out]  残り時間（フレーム値）
   */
  //------------------------------------------------------------------
   virtual void OnJoinSuccess( u32 timeLimitFrame ){}

  //------------------------------------------------------------------
  /**
   * @brief アトラクション参加失敗
   */
  //------------------------------------------------------------------
   virtual void OnJoinFailed( void ){}

  //------------------------------------------------------------------
  /**
   * @brief アトラクション作成成功
   */
  //------------------------------------------------------------------
   virtual void OnOpenSuccess( void ){}

  //------------------------------------------------------------------
  /**
   * @brief アトラクション作成失敗
   */
  //------------------------------------------------------------------
   virtual void OnOpenFailed( void ){}

   //------------------------------------------------------------------
   /**
   * @brief アトラクション終了成功
   */
   //------------------------------------------------------------------
   virtual void OnExitSuccess( void ){}

};

}    // JoinFesta
}    // NetAppLib

#endif // __JOIN_FESTA_ATTRACTION_LISTENER_H__
