//=============================================================================
/**
 * @file   gfl2_UI_RepeatTimer.h
 * @brief  リピート入力管理
 * @author obata_toshihiro
 * @date   2010.10.21
 */
//=============================================================================
#ifndef __gfl2_UI_REPEARTTIMER_H__
#define __gfl2_UI_REPEARTTIMER_H__
#include <macro/include/gfl2_Macros.h>
#include <ui/include/gfl2_UI_Types.h>

namespace gfl2 {
  namespace ui {

    class Device;

    class RepeatTimer 
    {
      GFL_FORBID_COPY_AND_ASSIGN( RepeatTimer );

      public:

      //-----------------------------------------------------------------------
      /**
       * @brief コンストラクタ
       * @param start_wait  最初のリピート判定までの待ち時間
       * @param interval    リピート判定の間隔
       */
      //-----------------------------------------------------------------------
      RepeatTimer( u32 start_wait, u32 interval );

      //-----------------------------------------------------------------------
      /**
       * @brief デストラクタ
       */
      //-----------------------------------------------------------------------
      virtual ~RepeatTimer();

      //-----------------------------------------------------------------------
      /**
       * @brief リピートタイミングかどうかを調べる
       */
      //-----------------------------------------------------------------------
      bool IsRepeat( void ) const;

      //-----------------------------------------------------------------------
      /**
       * @brief リピート管理状態を更新する
       */
      //-----------------------------------------------------------------------
      void Update( void );

      //-----------------------------------------------------------------------
      /**
       * @brief リピート管理状態をリセットする
       */
      //-----------------------------------------------------------------------
      void Reset( void );

      //-----------------------------------------------------------------------
      /**
       * @brief リピート検出パラメータを設定する
       * @param param 設定するパラメータ
       */
      //-----------------------------------------------------------------------
      void SetRepeatParam( const Device::RepeatParam& param );

      //-----------------------------------------------------------------------
      /**
       * @brief リピート検出パラメータを取得する
       * @param[out] p_param パラメータの格納先
       */
      //-----------------------------------------------------------------------
      void GetRepeatParam( Device::RepeatParam* p_param ) const; 


      protected: 
      Device::RepeatParam m_repeatParam; // リピート検出パラメータ
      u32 m_repeatCount; // リピート期間カウンタ
    };


  } //namespace ui
} //namespace gfl2 

#endif //__gfl2_UI_REPEARTTIMER_H__
