//=======================================================================================
/**
 * @file   gfl2_UI_System.cpp
 * @brief  UIシステム
 * @author obata_toshihiro
 * @date   2010.10.18
 */
//=======================================================================================
#include <ui/include/gfl2_UI_System.h>
#ifdef  GF_PLATFORM_CTR
#include <nn.h>
#endif

namespace gfl2 {
  namespace ui {


    //-----------------------------------------------------------------------------------
    // UIシステムを初期化する
    //-----------------------------------------------------------------------------------
    void Initialize( void )
    {
#ifdef  GF_PLATFORM_CTR
      nn::hid::Initialize();
#endif
    }


    //-----------------------------------------------------------------------------------
    // UIシステムを終了する
    //-----------------------------------------------------------------------------------
    void Finalize( void )
    {
#ifdef  GF_PLATFORM_CTR
      nn::hid::Finalize();
#endif
    }


  }  // namespace gfl2
}  // namespace ui
