#ifdef  GF_PLATFORM_CTR
//==============================================================================
/**
 * @file	gflnet2_P2pDisconnectionIr.h
 * @brief	P2Pプロセス：IR切断
 * @author	ichiraku_katsuhiko
 * @date	2015/03/18 16:25:18
 */
// =============================================================================

#ifndef __GFLNET2_P2P_DISCONNECTION_IR__
#define __GFLNET2_P2P_DISCONNECTION_IR__
#pragma once

#include "gflnet2/include/p2p/gflnet2_P2pDisconnectionInterface.h"

GFL_NAMESPACE_BEGIN( gflnet2 )
GFL_NAMESPACE_BEGIN( p2p )
GFL_NAMESPACE_BEGIN( proc )

//-----------------------------------------------------------------------------
//-----------------------------------------------------------------------------

class P2pDisconnectionIr : public P2pDisconnectionInterface
{
  GFL_FORBID_COPY_AND_ASSIGN(P2pDisconnectionIr); //コピーコンストラクタ＋代入禁止

  //-----------------------------------------------------------------------------
  /**
   *  定数
   */
  //-----------------------------------------------------------------------------

  //-----------------------------------------------------------------------------
  //-----------------------------------------------------------------------------

public:
  P2pDisconnectionIr(){};
  virtual ~P2pDisconnectionIr(){};


  //=============================================================================
  /**
   *  publicメソッド
   */
  //=============================================================================
  //---------------------------------------------------------------------------------
  /**
   * @brief   初期化処理
   * @param   Manager  管理クラス
   * @return  RES_FINISHで終了
   */
  //---------------------------------------------------------------------------------
  virtual gfl2::proc::Result InitFunc(gfl2::proc::Manager* );
  //---------------------------------------------------------------------------------
  /**
   * @brief   実行処理
   * @param   Manager  管理クラス
   * @return  RES_FINISHで終了
   */
  //---------------------------------------------------------------------------------
  virtual gfl2::proc::Result UpdateFunc(gfl2::proc::Manager*);
  //---------------------------------------------------------------------------------
  /**
   * @brief   終了処理
   * @param   Manager  管理クラス
   * @return  RES_FINISHで終了
   */
  //---------------------------------------------------------------------------------
  virtual gfl2::proc::Result EndFunc(gfl2::proc::Manager*);

 
  //=============================================================================
  /**
   *  privateメソッド
   */
  //=============================================================================

};

GFL_NAMESPACE_END( proc )
GFL_NAMESPACE_END( p2p )
GFL_NAMESPACE_END( gflnet2 )

#endif // __GFLNET2_P2P_DISCONNECTION_IR__
#endif // GF_PLATFORM_CTR