#ifdef  GF_PLATFORM_CTR
//==============================================================================
/**
 * @file	gflnet2_P2pMainIr.h
 * @brief	P2Pプロセス：IRメイン
 * @author	ichiraku_katsuhiko
 * @date	2015/03/18 16:23:11
 */
// =============================================================================

#ifndef __GFLNET2_P2P_MAIN_IR__
#define __GFLNET2_P2P_MAIN_IR__
#pragma once

#include "gflnet2/source/p2p/thread/gflnet2_IrP2pThread.h"

#include "gflnet2/include/p2p/gflnet2_P2pProcBaseProcess.h"

GFL_NAMESPACE_BEGIN( gflnet2 )
GFL_NAMESPACE_BEGIN( p2p )
GFL_NAMESPACE_BEGIN( proc )

//-----------------------------------------------------------------------------
//-----------------------------------------------------------------------------

class P2pMainIr : public P2pBaseProcess
{
  GFL_FORBID_COPY_AND_ASSIGN(P2pMainIr); //コピーコンストラクタ＋代入禁止

  //-----------------------------------------------------------------------------
  /**
   *  定数
   */
  //-----------------------------------------------------------------------------

  //-----------------------------------------------------------------------------
  //-----------------------------------------------------------------------------
  nn::os::CriticalSection m_criticalSection;  //守るところ
  gflnet2::p2p::IrP2pThread* m_thread;   //起動スレッド


public:
  P2pMainIr() :
    m_criticalSection(),
    m_thread( NULL )
  {
  };
  virtual ~P2pMainIr(){};

  //=============================================================================
  /**
   *  publicメソッド
   */
  //=============================================================================
  //---------------------------------------------------------------------------------
  /**
   * @brief   初期化処理
   * @param   Manager  管理クラス
   * @return  RES_FINISHで終了
   */
  //---------------------------------------------------------------------------------
  virtual gfl2::proc::Result InitFunc(gfl2::proc::Manager* );
  //---------------------------------------------------------------------------------
  /**
   * @brief   実行処理
   * @param   Manager  管理クラス
   * @return  RES_FINISHで終了
   */
  //---------------------------------------------------------------------------------
  virtual gfl2::proc::Result UpdateFunc(gfl2::proc::Manager*);
  //---------------------------------------------------------------------------------
  /**
   * @brief   終了処理
   * @param   Manager  管理クラス
   * @return  RES_FINISHで終了
   */
  //---------------------------------------------------------------------------------
  virtual gfl2::proc::Result EndFunc(gfl2::proc::Manager*);

  //データ送信
  //----------------------------------------------------------------------------
  /**
   * @brief  送信
   * @return 送れたらTRUE
   */
  //----------------------------------------------------------------------------
  bool SendData(void* data, u32 size );
  //----------------------------------------------------------------------------
  /**
   * @brief データ受信
   * @return 0だと何も入っていない
   */
  //----------------------------------------------------------------------------
  u32 RecvData(void* data, u32 size );

  //=============================================================================
  /**
   *  privateメソッド
   */
  //=============================================================================

};

GFL_NAMESPACE_END( proc )
GFL_NAMESPACE_END( p2p )
GFL_NAMESPACE_END( gflnet2 )

#endif // __GFLNET2_P2P_MAIN_IR__
#endif // GF_PLATFORM_CTR