//[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[
/**
 *	GAME FREAK inc.
 *
 *	@file		gfl_UtilTexture.CPP
 *	@brief  テクスチャクラス
 *	@author	Masateru Ishiguro
 *	@date		2011.2.23
 *
 */
//]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]

#include <debug/gfl_Assert.h>
#include <grp/gfl_GraphicsType.h>
#include <grp/util/gfl_UtilTexture.h>

#define			RGBA32(r, g, b, a)	(a << 24) | (b << 16) | (g << 8) | (r << 0)

namespace gfl { namespace grp { namespace util {

//-----------------------------------------------------------------------------
/// @brief	
//-----------------------------------------------------------------------------
Texture::Texture()
{

}

//-----------------------------------------------------------------------------
/// @brief	
//-----------------------------------------------------------------------------
Texture::~Texture()
{
  //@fix BTS[4977] 実行権限が与えられていない場合、RunAsyncを実行するとハングする。そのそも不要だったので消します。
  glDeleteTextures( 1, &m_hTexture );
}

}}}
