//=============================================================================
/**
 * @file    TrainerPassGamedata.h
 * @brief   トレーナーパス画面 ゲーム中に保持し続けるデータ
 * @author  Hiroyuki Nakamura
 * @date    2015.11.10
 */
//=============================================================================
#if !defined( TRAINER_PASS_GAMEDATA_H_INCLUDED )
#define TRAINER_PASS_GAMEDATA_H_INCLUDED

#pragma once

// gflib
#include <types/include/gfl2_Typedef.h>
#include <macro/include/gfl2_Macros.h>


GFL_NAMESPACE_BEGIN(App)
GFL_NAMESPACE_BEGIN(TrainerPass)

//=============================================================================
/**
 * @class PlayData
 * @brief トレーナーパス画面ゲームデータ
 * @date  2015.11.10
 */
//=============================================================================
class PlayData
{
public:
  //-----------------------------------------------------------------------------
  /**
   * @brief   コンストラクタ
   */
  //-----------------------------------------------------------------------------
  PlayData(void);

  //-----------------------------------------------------------------------------
  /**
   * @brief   デストラクタ
   */
  //-----------------------------------------------------------------------------
  virtual ~PlayData();

  //-----------------------------------------------------------------------------
  /**
   * @func    GetStampPage
   * @brief   スタンプページ番号取得
   * @date    2015.11.10
   *
   * @return  スタンプページ番号
   */
  //-----------------------------------------------------------------------------
  s32 GetStampPage(void);

  //-----------------------------------------------------------------------------
  /**
   * @func    SetStampPage
   * @brief   スタンプページ番号セット
   * @date    2015.11.10
   *
   * @param   スタンプページ番号
   */
  //-----------------------------------------------------------------------------
  void SetStampPage( s32 page );


private:
  s32 m_stampPage;  //!< スタンプのページ番号
};


GFL_NAMESPACE_END(TrainerPass)
GFL_NAMESPACE_END(App)

#endif  // TRAINER_PASS_GAMEDATA_H_INCLUDED
