#ifdef  GF_PLATFORM_CTR
//==============================================================================
/**
 * @file	gflnet2_P2pMainWireless.h
 * @brief	P2Pプロセス：Wirelessメイン
 * @author	ichiraku_katsuhiko
 * @date	2015/03/18 16:34:22
 */
// =============================================================================

#ifndef __GFLNET2_P2P_MAIN_WIRELESS__
#define __GFLNET2_P2P_MAIN_WIRELESS__
#pragma once

#include "gflnet2/include/p2p/gflnet2_P2pProcBaseProcess.h"

GFL_NAMESPACE_BEGIN( gflnet2 )
GFL_NAMESPACE_BEGIN( p2p )
GFL_NAMESPACE_BEGIN( proc )

//-----------------------------------------------------------------------------
//-----------------------------------------------------------------------------

class P2pMainWireless : public P2pBaseProcess
{
  GFL_FORBID_COPY_AND_ASSIGN(P2pMainWireless); //コピーコンストラクタ＋代入禁止

  //-----------------------------------------------------------------------------
  /**
   *  定数
   */
  //-----------------------------------------------------------------------------

  //-----------------------------------------------------------------------------
  //-----------------------------------------------------------------------------
  bool m_isKickMe;  // StationをKickしたフラグ

public:
  P2pMainWireless() : m_isKickMe( false ) {};
  virtual ~P2pMainWireless(){};

  //=============================================================================
  /**
   *  publicメソッド
   */
  //=============================================================================
  //---------------------------------------------------------------------------------
  /**
   * @brief   初期化処理
   * @param   Manager  管理クラス
   * @return  RES_FINISHで終了
   */
  //---------------------------------------------------------------------------------
  virtual gfl2::proc::Result InitFunc(gfl2::proc::Manager* );
  //---------------------------------------------------------------------------------
  /**
   * @brief   実行処理
   * @param   Manager  管理クラス
   * @return  RES_FINISHで終了
   */
  //---------------------------------------------------------------------------------
  virtual gfl2::proc::Result UpdateFunc(gfl2::proc::Manager*);
  //---------------------------------------------------------------------------------
  /**
   * @brief   終了処理
   * @param   Manager  管理クラス
   * @return  RES_FINISHで終了
   */
  //---------------------------------------------------------------------------------
  virtual gfl2::proc::Result EndFunc(gfl2::proc::Manager*);


  //=============================================================================
  /**
   *  privateメソッド
   */
  //=============================================================================

};

GFL_NAMESPACE_END( proc )
GFL_NAMESPACE_END( p2p )
GFL_NAMESPACE_END( gflnet2 )

#endif // __GFLNET2_P2P_MAIN_WIRELESS__
#endif // GF_PLATFORM_CTR
