//==============================================================================
/**
 * @file	JoinFestaDefine.h
 * @brief	ジョインフェスタの定義類
 * @author	ichiraku_katsuhiko
 * @date	2015/05/28 19:23:14
 */
// =============================================================================

#ifndef __JF_DEFINE__
#define __JF_DEFINE__
#pragma once

#include <types/include/gfl2_Typedef.h>

//-----------------------------------------------------------------------------

namespace NetApp{
namespace JoinFesta{


//-------------------------------------
/// デバッグメニュー
//=====================================
#if PM_DEBUG
#define JF_DEBUG_MENU
#endif // PM_DEBUG


//-------------------------------------
/// 関数の結果
//=====================================
typedef enum
{
  RESULT_CONTINUE,    ///< 動作継続中
  RESULT_FINISH,      ///< 動作終了
}RESULT;

/**
 *  @brief  ジョインフェスタ汎用定義クラス
 */
class JoinFestaDefine
{
public:

  /* ----------------------------------------------------------------------------------------- */
  /**
   *  @brief 動的に出現するJFモデルの最大数
   */
  /* ----------------------------------------------------------------------------------------- */
  static const u32 JFMODEL_DISP_MAX = 5;  

  /* ----------------------------------------------------------------------------------------- */
  /**
   *  @brief JFモデルを配置するポイントの最大数
   */
  /* ----------------------------------------------------------------------------------------- */
  static const u32 JFPOINT_MAX = 32;  

  /* ----------------------------------------------------------------------------------------- */
  /**
   *  @brief JFモデル表示範囲（半径）
   */
  /* ----------------------------------------------------------------------------------------- */
  static const u32 JFMODEL_DISP_DISTANCE = 1000;  

  /* ----------------------------------------------------------------------------------------- */
  /**
   *  @brief JFモデルのeventIDオフセット値
   *  @note   フィールドの動作モデルにはeventIDがあり、それはユニークである必要がある。
   */
  /* ----------------------------------------------------------------------------------------- */
  static const u32 MODEL_EVENT_ID_OFFSET = 20;

  /* ----------------------------------------------------------------------------------------- */
  /**
   *  @brief 店員モデルのeventIDオフセット値
   *  @note   フィールドの動作モデルにはeventIDがあり、それはユニークである必要がある。
   */
  /* ----------------------------------------------------------------------------------------- */
  static const u32 ASSISTANT_EVENT_ID_OFFSET = 60;

  /* ----------------------------------------------------------------------------------------- */
  /**
   *  @brief ジョインフェスタの名前の最大文字数
   */
  /* ----------------------------------------------------------------------------------------- */
  static const u32 STRLEN_JOIN_FESTA_NAME = 20;

  /* ----------------------------------------------------------------------------------------- */
  /**
   *  @brief プリセットNPCを出す条件
   */
  /* ----------------------------------------------------------------------------------------- */
  static const u32 PRESET_OPEN_NUM = 5;

  /* ----------------------------------------------------------------------------------------- */
  /**
   *  @brief プリセットNPCの数
   */
  /* ----------------------------------------------------------------------------------------- */
  static const u32 PRESET_ID_MAX = 12;


  // 最大値
  enum{
    RANK_MAX = 999,       //! ランク最大値
    COIN_MAX = 9999999,   //! コイン最大値
    FACILITIES_RANK_MAX = 5,    //! 施設ランク最大値

    MAX_FESRANK_RANKUP_COIN = 300,  //! フェスランク最大値からランクアップ扱いになるコイン数
  };

};

} // namespace JoinFesta
} // namespace NetApp

#endif // __JF_DEFINE__
