#ifdef  GF_PLATFORM_CTR
//==============================================================================
/**
 * @file	gflnet2_P2pSimpleDisconnectionWifi.h
 * @brief	P2Pプロセス：WIfi切断（シンプルマッチメイク版）ミラクル交換専用
 * @author	ichiraku_katsuhiko
 * @date	2016/01/20　23:07
 */
// =============================================================================

#ifndef __GFLNET2_P2P_SIMPLE_DISCONNECTION_WIFI__
#define __GFLNET2_P2P_SIMPLE_DISCONNECTION_WIFI__
#pragma once

#include <nex_P2p.h>
#include <gflnet2/include/nex/gflnet2_NexManager.h>
#include <gflnet2/include/nex/gflnet2_NexMatchMakingClient.h>

#include "gflnet2/include/p2p/gflnet2_P2pDisconnectionInterface.h"

GFL_NAMESPACE_BEGIN( gflnet2 )
GFL_NAMESPACE_BEGIN( p2p )
GFL_NAMESPACE_BEGIN( proc )

//-----------------------------------------------------------------------------
//-----------------------------------------------------------------------------

class P2pSimpleDisconnectionWifi : public P2pDisconnectionInterface
{
  GFL_FORBID_COPY_AND_ASSIGN(P2pSimpleDisconnectionWifi); //コピーコンストラクタ＋代入禁止

  //-----------------------------------------------------------------------------
  /**
   *  定数
   */
  //-----------------------------------------------------------------------------
  static const int END_MATCH_TIMEOUT_COUNT = 100; // マッチメイクの終了タイムアウト値

  //-----------------------------------------------------------------------------
  //-----------------------------------------------------------------------------

private:
  gflnet2::nex::NexManager* m_nexManager;
  gflnet2::nex::NexMatchMakingClient* m_nexMatchMakeClient;   ///< マッチメイククライアント

public:
  P2pSimpleDisconnectionWifi() :
    m_nexManager( NULL ),
    m_nexMatchMakeClient( NULL )
  {
  };
  virtual ~P2pSimpleDisconnectionWifi(){};

  //=============================================================================
  /**
   *  publicメソッド
   */
  //=============================================================================
  //---------------------------------------------------------------------------------
  /**
   * @brief   初期化処理
   * @param   Manager  管理クラス
   * @return  RES_FINISHで終了
   */
  //---------------------------------------------------------------------------------
  virtual gfl2::proc::Result InitFunc(gfl2::proc::Manager* );
  //---------------------------------------------------------------------------------
  /**
   * @brief   実行処理
   * @param   Manager  管理クラス
   * @return  RES_FINISHで終了
   */
  //---------------------------------------------------------------------------------
  virtual gfl2::proc::Result UpdateFunc(gfl2::proc::Manager*);
  //---------------------------------------------------------------------------------
  /**
   * @brief   終了処理
   * @param   Manager  管理クラス
   * @return  RES_FINISHで終了
   */
  //---------------------------------------------------------------------------------
  virtual gfl2::proc::Result EndFunc(gfl2::proc::Manager*);

  //=============================================================================
  /**
   *  privateメソッド
   */
  //=============================================================================
  //------------------------------------------------------------------
  /**
   * @brief   NATトラバーサルのUnbind
   */
  //------------------------------------------------------------------
  void UnbindNatTraversal( void );

  //------------------------------------------------------------------
  /**
   * @brief   NATトラバーサルの終了
   * @return  実行に成功したならtrueが返却される
   */
  //------------------------------------------------------------------
  bool EndNatTraversal( void );

  //------------------------------------------------------------------
  /**
   * @brief   NetZの削除
   * @return  実行に成功したならtrueが返却される
   */
  //------------------------------------------------------------------
  bool DeleteNetZ( void );

  //------------------------------------------------------------------
  /**
   * @brief   マッチメイクのキャンセルリクエスト発行
   */
  //------------------------------------------------------------------
  void CancelMatchmake( void );

  //------------------------------------------------------------------
  /**
   * @brief   マッチメイクのキャンセル待ち
   */
  //------------------------------------------------------------------
  bool IsCancelMatchmake( void );

  //------------------------------------------------------------------
  /**
   * @brief   マッチメイクの終了
   */
  //------------------------------------------------------------------
  void EndMatchmake( void );

  //------------------------------------------------------------------
  /**
   * @brief   マッチメイクの終了完了待ち
   */
  //------------------------------------------------------------------
  bool IsEndMatchmake( void );

  //------------------------------------------------------------------
  /**
   * @brief   マッチメイクの削除
   */
  //------------------------------------------------------------------
  void DeleteMatchmake( void );

};

GFL_NAMESPACE_END( proc )
GFL_NAMESPACE_END( p2p )
GFL_NAMESPACE_END( gflnet2 )

#endif // __GFLNET2_P2P_DISCONNECTION_WIFI__
#endif // GF_PLATFORM_CTR