//============================================================================================
/**
 * @file    gfl2_StreamingUncomp.h
 * @brief    LZ77圧縮データのストリーミング展開処理
 * @author  Hiroyuki Nakamura
 * @date    11.10.25
 */
//============================================================================================
#ifndef  __GFL2_STREAMINGUNCOMP_H__
#define  __GFL2_STREAMINGUNCOMP_H__
#pragma once


#include <fs/include/gfl2_FsArcFile.h>
#include <heap/include/gfl2_heap_base.h>



GFL_NAMESPACE_BEGIN(gfl2)
GFL_NAMESPACE_BEGIN(cx)
  

//----------------------------------------------------------------------------
/**
 *  @brief  圧縮解凍後のメモリサイズを取得
 *
 *  @return 圧縮解凍後のメモリサイズ
 */
//-----------------------------------------------------------------------------
extern u32 GetUncompressedSize( const void* cpData, u32 nCompSize = 0 );

//--------------------------------------------------------------------------------------------
/**
 * @brief    圧縮解凍処理
 *
 * @param    cpSrc    圧縮データ
 * @param    pDest    解凍先メモリ
 * @param    heap    ヒープ
 */
//--------------------------------------------------------------------------------------------
extern void Uncompress( const void * cpSrc, void * pDest, gfl2::heap::HeapBase * heap=NULL, u32 nCompSize = 0 );

//--------------------------------------------------------------------------------------------
/**
 * @brief    エラーチェック付き圧縮解凍処理（データタイプ指定）
 *
 * @param    cpSrc        圧縮データ
 * @param    cpSrcSize    圧縮データのサイズ
 * @param    type        圧縮データタイプ
 * @param    pDest        解凍先メモリ
 * @param    heap        ヒープ
 *
 * @retval  "0 なら成功"
 * @retval  "0 より大きいならエラーコード"
 */
//--------------------------------------------------------------------------------------------
#if defined(GF_PLATFORM_CTR)
extern s32 SecureUncompress( const void * cpSrc, u32 cpSrcSize, nn::cx::CompressionType type, void * pDest, gfl2::heap::HeapBase * heap=NULL );
#endif

//--------------------------------------------------------------------------------------------
/**
 * @brief    エラーチェック付き圧縮解凍処理
 *
 * @param    cpSrc        圧縮データ
 * @param    cpSrcSize    圧縮データのサイズ
 * @param    pDest        解凍先メモリ
 * @param    heap        ヒープ
 *
 * @retval  "0 なら成功"
 * @retval  "0 より大きいならエラーコード"
 */
//--------------------------------------------------------------------------------------------
extern u32 SecureUncompress( const void * cpSrc, u32 cpSrcSize, void * pDest, gfl2::heap::HeapBase * heap );


#if 0
class StreamingUncomp {
public:
  //--------------------------------------------------------------------------------------------
  /**
   * @brief    コンストラクタ
   */
  //--------------------------------------------------------------------------------------------
  StreamingUncomp(void);

  //--------------------------------------------------------------------------------------------
  /**
  
   * @brief    デストラクタ
   */
  //--------------------------------------------------------------------------------------------
  ~StreamingUncomp(void);

  //--------------------------------------------------------------------------------------------
  /**
   * @brief    圧縮データ展開準備
   *
   * @param    devHeap    デバイスヒープ(普通のヒープメモリでもOKです)
   * @param    src        圧縮データ
   * @param    src_size  圧縮データのサイズ
   * @param    dest      展開先
   *
   * @li  destは各自削除を。
   */
  //--------------------------------------------------------------------------------------------
  void InitUncomp( gfl2::heap::HeapBase * devHeap, void * src, u32 src_size, void ** dest );

  //--------------------------------------------------------------------------------------------
  /**
   * @brief    圧縮データ展開
   *
   * @retval  "true = 処理中"
   * @retval  "false = それ以外"
   */
  //--------------------------------------------------------------------------------------------
  bool ReadUncomp(void);

  //--------------------------------------------------------------------------------------------
  /**
   * @brief    圧縮データ一括展開準備
   *
   * @param    devHeap    デバイスヒープ(普通のヒープメモリでもOKです)
   * @param    src        圧縮データ
   * @param    src_size  圧縮データのサイズ
   * @param    dest      展開先
   *
   * @li  destは各自削除を。
   */
  //--------------------------------------------------------------------------------------------
  void InitUncompPackage( gfl2::heap::HeapBase * devHeap, void * src, u32 src_size, void ** dest );
  
  //--------------------------------------------------------------------------------------------
  /**
   * @brief    圧縮データ一括展開(エラーチェック)
   *
   * @return  変換に成功した場合は 0 を、失敗した場合には負のエラーコードを返します。
   */
  //--------------------------------------------------------------------------------------------
  s32 SecureUncomp(void);

private:
  //--------------------------------------------------------------------------------------------
  /**
   * @brief    圧縮タイプごとの設定
   *
   * @param    heap  ヒープ
   */
  //--------------------------------------------------------------------------------------------
  void InitCompType( gfl2::heap::HeapBase * heap );

  //--------------------------------------------------------------------------------------------
  /**
   * @brief    圧縮タイプごとの設定削除
   */
  //--------------------------------------------------------------------------------------------
  void ExitCompType(void);

private:
  void ** pDest;    //!< 展開先
  void * pSrc;      //!< 圧縮データ
  u32  srcSize;     //!< 圧縮データサイズ
#if defined(GF_PLATFORM_CTR)
  nn::cx::CompressionType  compType;  //!< 圧縮タイプ
#endif
	void * context;                     //!< 展開コンテキスト

  gfl2::heap::HeapBase * pDevHeap;    //!< デバイスヒープ

  int  seq;        //!< シーケンス
  int  cancelSeq;  //!< キャンセル用シーケンス
};
#endif


////////////////////////////////////////////////////////////////////////////////
#if defined(GF_PLATFORM_WIN32)
// サンプル
extern void UncompTest( void );
#endif
////////////////////////////////////////////////////////////////////////////////


GFL_NAMESPACE_END(cx)
GFL_NAMESPACE_END(gfl2)


#endif  // __GFL2_STREAMINGUNCOMP_H__



