//=============================================================================
/**
 * @file    gfl2_LytMultiResID.cpp
 * @brief   レイアウトリソースID
 * @author  Hiroyuki Nakamura
 * @date    2014.12.19
 */
//=============================================================================
#include <layout/include/gfl2_LytMultiResID.h>


GFL_NAMESPACE_BEGIN(gfl2)
GFL_NAMESPACE_BEGIN(lyt)

//-----------------------------------------------------------------------------
/**
 * @brief   コンストラクタ
 */
//-----------------------------------------------------------------------------
LytMultiResID::LytMultiResID(void)
{
  Init();
}

//-----------------------------------------------------------------------------
/**
 * @brief   デストラクタ
 */
//-----------------------------------------------------------------------------
LytMultiResID::~LytMultiResID()
{
}

//-----------------------------------------------------------------------------
/**
 * @brief   初期化
 */
//-----------------------------------------------------------------------------
void LytMultiResID::Init(void)
{
  parentID = NULL_ID;
  multiID  = NULL_ID;
}

//-----------------------------------------------------------------------------
/**
 * @brief   IDが設定されているか
 *
 * @retval  "true = 設定されている"
 * @retval  "false = それ以外"
 */
//-----------------------------------------------------------------------------
bool LytMultiResID::IsEnable(void) const
{
  if( parentID == NULL_ID )
  {
    return false;
  }
  return true;
}

//-----------------------------------------------------------------------------
/**
 * @brief   親IDを取得
 *
 * @return  親ID
 */
//-----------------------------------------------------------------------------
u16 LytMultiResID::GetParentID(void) const
{
  return parentID;
}

//-----------------------------------------------------------------------------
/**
 * @brief   親IDを設定
 *
 * @param   id  セットするID
 */
//-----------------------------------------------------------------------------
void LytMultiResID::SetParentID( u16 id )
{
  parentID = id;
}

//-----------------------------------------------------------------------------
/**
 * @brief   登録IDを取得
 *
 * @return  登録ID
 */
//-----------------------------------------------------------------------------
u16 LytMultiResID::GetMultiID(void) const
{
  return multiID;
}

//-----------------------------------------------------------------------------
/**
 * @brief   登録IDを設定
 *
 * @param   id  セットするID
 */
//-----------------------------------------------------------------------------
void LytMultiResID::SetMultiID( u16 id )
{
  multiID = id;
}


GFL_NAMESPACE_END(lyt)
GFL_NAMESPACE_END(gfl2)
