#ifndef __HEAP_SIZE_H__
#define __HEAP_SIZE_H__
#pragma once
//======================================================================
/**
 * @file	  heap_size.h
 * @brief	  HEAPSIZE定義
 * @author	k.ohno
 * @date	  11/03/29
 */
//======================================================================

namespace heapdefine{

  //-----------------------------------------------------------------------------
  /*
   *    ヒープメモリとデバイスメモリのサイズ
   */
  //-----------------------------------------------------------------------------
  /// ヒープメモリの最大サイズ  (12MByte)
  static const u32 HEAP_MEMORY    = (12*1024*1024);
  /// デバイスメモリの最大サイズ(45MByte) 
  static const u32 DEVICE_MEMORY = (12*1024*1024);

}; /* heapsize */

#endif //__HEAP_SIZE_H__
