//=============================================================================
/**
 * @file    app_tool_MsgCursor.h
 * @brief   メッセージカーソル
 * @author  Hiroyuki Nakamura
 * @date    12.04.25
 */
//=============================================================================
#if !defined( APP_TOOL_MSG_CURSOR_H_INCLUDED )
#define APP_TOOL_MSG_CURSOR_H_INCLUDED

#pragma once

// gflib2
#include <Layout/include/gfl2_Layout.h>


GFL_NAMESPACE_BEGIN(App)
GFL_NAMESPACE_BEGIN(Tool)

//=============================================================================
/**
 * @class MsgCursor
 * @brief メッセージカーソルクラス
 * @date  12.04.25
 */
//=============================================================================
class MsgCursor
{
public:
  //-----------------------------------------------------------------------------
  /**
   * @brief   コンストラクタ
   *
   * @param   pane  カーソルペイン
   */
  //-----------------------------------------------------------------------------
  MsgCursor( gfl2::lyt::LytPane * pane );

  //-----------------------------------------------------------------------------
  /**
   * @brief   デストラクタ
   */
  //-----------------------------------------------------------------------------
  virtual ~MsgCursor();

  //-----------------------------------------------------------------------------
  /**
   * @func    SetVisible
   * @brief   表示切り替え
   * @date    2015.06.25
   *
   * @param   flg   true = 表示, false = 非表示
   */
  //-----------------------------------------------------------------------------
  void SetVisible( bool flg );

  //-----------------------------------------------------------------------------
  /**
   * @brief   手動で表示を操作する
   *
   * @param   flg   true = 手動
   */
  //-----------------------------------------------------------------------------
  void SetVisibleUser( bool flg );

  //-----------------------------------------------------------------------------
  /**
   * @brief   手動で表示を操作するか
   *
   * @retval  true  = 手動
   * @retval  false = それ以外
   */
  //-----------------------------------------------------------------------------
  bool GetVisibleUser(void);


private:
  gfl2::lyt::LytPane * m_pane;  //!< カーソルペイン
  bool m_visibleUser;           //!< 手動表示切り替えフラグ
};

GFL_NAMESPACE_END(Tool)
GFL_NAMESPACE_END(App)

#endif  // APP_TOOL_MSG_CURSOR_H_INCLUDED
