//=============================================================================
/**
 * @brief  アーカイブファイルアクセッサのインターフェース
 * @file   gfl_ArchiveFileAccessor.cpp
 * @author obata_toshihiro
 * @date   2012.04.27
 */
//=============================================================================
#include "./gfl_IArcFileAccessor.h"

namespace gfl {
  namespace fs { 


    //-------------------------------------------------------------------------
    /**
     * @brief コンストラクタ
     */
    //-------------------------------------------------------------------------
    IArcFileAccessor::IArcFileAccessor( void )
    {
    }

    //-------------------------------------------------------------------------
    /**
     * @brief デストラクタ
     */
    //-------------------------------------------------------------------------
    IArcFileAccessor::~IArcFileAccessor()
    {
    }


  } //namespace fs
} //namespace gfl
