//=================================================================================================
/**
 *  @file   CollisionScene2D.cpp
 *  @brief  2Dコリジョンシーン
 *  @author yy-ikeuchi@gamefreak.co.jp
 *  @date   2015.02.17
 */
//=================================================================================================
#include "../../include/Collision/CollisionScene2D.h"
#include "../../include/Collision/CollisionSolver2D.h"

//-----------------------------------------------------------------------------
/**
*  @brief  コンストラクタ
*/
//-----------------------------------------------------------------------------
CollisionScene2D::CollisionScene2D()
{
}

//-----------------------------------------------------------------------------
/**
*  @brief  デストラクタ
*/
//-----------------------------------------------------------------------------
CollisionScene2D::~CollisionScene2D()
{
}

//----------------------------------------------------------------------------
/**
*  @brief   解決者の作成
*
*  @return  solver
*  @note    この関数をオーバーライドすることにより衝突の挙動を変更できます
*/
//-----------------------------------------------------------------------------
BaseSolver* CollisionScene2D::createSolver(void)
{
  // 狙ってデフォルトnewを使用しています。(親クラスのm_pAllocatorから取られます)
  return new CollisionSolver2D();
}