//=================================================================================================
/**
 *  @file   CollisionScene3D.cpp
 *  @brief  3Dコリジョンシーン
 *  @author yy-ikeuchi@gamefreak.co.jp
 *  @date   2015.02.17
 */
//=================================================================================================
#include "../../include/Collision/CollisionScene3D.h"
#include "../../include/Collision/CollisionSolver3D.h"

//-----------------------------------------------------------------------------
/**
*  @brief  コンストラクタ
*/
//-----------------------------------------------------------------------------
CollisionScene3D::CollisionScene3D()
{
}

//-----------------------------------------------------------------------------
/**
*  @brief  デストラクタ
*/
//-----------------------------------------------------------------------------
CollisionScene3D::~CollisionScene3D()
{
}

//----------------------------------------------------------------------------
/**
*  @brief   解決者の作成
*
*  @return  solver
*  @note    この関数をオーバーライドすることにより衝突の挙動を変更できます
*/
//-----------------------------------------------------------------------------
BaseSolver* CollisionScene3D::createSolver(void)
{
  // 狙ってデフォルトnewを使用しています。(親クラスのm_pAllocatorから取られます)
  return new CollisionSolver3D();
}