#pragma once
//=================================================================================================
/**
*  @file   FieldMoveCodeManager.h
*  @brief  フィールド用 動作コードマネージャー
*  @author yy-ikeuchi@gamefreak.co.jp
*  @date   2015.02.17
*/
//=================================================================================================
#include <heap/include/gfl2_Heap.h>
#include <debug/include/gfl2_Assert.h>
#include "FieldMoveCode_define.h"

namespace Field{ namespace MoveModel {

class FieldMoveModel;
class FieldMoveCodeBase;

class FieldMoveCodeManager
{
public:

  //=====================================================================================================================
  //! @brief マネージャー自身に関する操作
  //=====================================================================================================================

  //-----------------------------------------------------------------------------
  /**
  *  @brief  コンストラクタ
  */
  //-----------------------------------------------------------------------------
  FieldMoveCodeManager();

  //-----------------------------------------------------------------------------
  /**
  *  @brief  デストラクタ
  */
  //-----------------------------------------------------------------------------
  ~FieldMoveCodeManager();

  //----------------------------------------------------------------------------
  /**
  *  @brief  初期化
  *
  *  @param  pHeap  ワーク作成時に利用するヒープ
  */
  //-----------------------------------------------------------------------------
  void Initialize(gfl2::heap::HeapBase * pHeap);

  //----------------------------------------------------------------------------
  /**
  *  @brief  解放
  */
  //-----------------------------------------------------------------------------
  void Terminate(void);

  //----------------------------------------------------------------------------
  /**
  *  @brief  動作コードの取得
  *
  *  @param  fieldMoveCodeId   動作コードID
  *  @return 動作コード
  */
  //-----------------------------------------------------------------------------
  static const FieldMoveCodeBase* GetMoveCode(FIELD_MOVE_CODE_ID fieldMoveCodeId);

  //=====================================================================================================================
  //! @brief 動作コードのワークに関する操作
  //=====================================================================================================================

  //----------------------------------------------------------------------------
  /**
  *  @brief  動作コードのワークを初期化
  *
  *  @param  pMoveCodeWork  動作コードワーク
  *  @param  pModel         動作モデル
  */
  //-----------------------------------------------------------------------------
  static void InitializeMoveCodeWork(FieldMoveCodeWork* pMoveCodeWork, FieldMoveModel* pModel);

  //----------------------------------------------------------------------------
  /**
  *  @brief  動作コードのワークを取得
  *    
  *  @param  pMoveCodeWork  動作コードワーク
  *  @param  size           必要なサイズ
  *  @return 動作コードワーク
  */
  //-----------------------------------------------------------------------------
  static void* GetMoveCodeWork(FieldMoveCodeWork* pMoveCodeWork, u32 size);

private:

  //=====================================================================================================================
  //! @brief 内部
  //=====================================================================================================================

  // 動作コードテーブル
  static const FieldMoveCodeBase *m_MoveCodeTable[ Field::MoveModel::FIELD_MOVE_CODE_NONE ];
};

}; //end of namespace MoveModel
}; //end of namespace Field

