#pragma once
//=================================================================================================
/**
*  @file   FieldMoveCode_define.h
*  @brief  フィールド用 動作コードの定義
*  @author yy-ikeuchi@gamefreak.co.jp
*  @date   2015.02.17
*/
//=================================================================================================

namespace Field{ namespace MoveModel {

  class FieldMoveModel;

  //----------------------------------------------------------------------------------------
  //! @brief 動作コード用のID
  //----------------------------------------------------------------------------------------
  enum FIELD_MOVE_CODE_ID
  {
    FIELD_MOVE_CODE_NONE,         ///< 何も動かない動作コード
    FIELD_MOVE_CODE_PLAYER,       ///< プレイヤー動作コード
    ///FIELD_MOVE_CODE_TEMPLATE,     ///< 量産用のテンプレート動作コード
    FIELD_MOVE_CODE_NUM           ///< 動作コード最大数
  };

  //----------------------------------------------------------------------------------------
  //! @brief 動作モデルの各インスタンスが保持する動作コードのワークサイズ
  //----------------------------------------------------------------------------------------
  enum
  {
    FIELD_MOVE_CODE_WORK_SIZE = 64
  };

  //----------------------------------------------------------------------------------------
  //! @brief 動作コードの共通ワーク
  //----------------------------------------------------------------------------------------
  struct FieldMoveCodeWork
  {
    FieldMoveModel*   pModel;                             ///< 動作モデルのワーク
    u32               moveCodeId;                         ///< 動作の種類
    u32               work[FIELD_MOVE_CODE_WORK_SIZE/4];  ///< フリーに使える共有ワーク
  };

}; //end of namespace MoveModel
}; //end of namespace Field
