#if !defined( __FINDER_MENU_DRAW_LISTENER_H__ )
#define __FINDER_MENU_DRAW_LISTENER_H__
#pragma once
//======================================================================
/**
 * @file    FinderMenuDrawListener.h
 * @date    2015/11/02 18:03:08
 * @author  fukushima_yuya
 * @brief   ファインダーメニュー描画リスナー
 * @par Copyright
 * (C)1995-2015 GAME FREAK inc. All Rights Reserved.
 */
//======================================================================

// gflib2
#include <macro/include/gfl2_Macros.h>
#include <types/include/gfl2_Typedef.h>


GFL_NAMESPACE_BEGIN(App)
GFL_NAMESPACE_BEGIN(FinderMenu)

//------------------------------------------------------------------------------
// @brief   描画リスナー
//------------------------------------------------------------------------------
class FinderMenuDrawListener
{
public:
  //------------------------------------------------------------------
  /**
   * @brief   終了通知
   */
  //------------------------------------------------------------------
  virtual void EndFinderMenu( void ) { ; }

  //------------------------------------------------------------------
  /**
   * @brief   ファインダーを継続する設定
   *
   * @param   flag    継続フラグ
   */
  //------------------------------------------------------------------
  virtual void SetFinderContinue( bool flag ) { ; }

public:
  //------------------------------------------------------------------
  /**
   * @brief   写真選択位置の設定
   * @param   index   選択位置
   */
  //------------------------------------------------------------------
  virtual void SetSelectPhoto( u32 index ) { ; }

  //------------------------------------------------------------------
  /**
   * @brief   コメント演出を開く
   * @param   photoIdx    写真インデックス
   */
  //------------------------------------------------------------------
  virtual void OpenCommentProduct( u32 photoIdx ) { ; }

  //------------------------------------------------------------------
  /**
   * @brief   コメントリストを開く
   */
  //------------------------------------------------------------------
  virtual void OpenCommentList( void ) { ; }

  //------------------------------------------------------------------
  /**
   * @brief   得点表示を開く
   */
  //------------------------------------------------------------------
  virtual void OpenScore( void ) { ; }

  //------------------------------------------------------------------
  /**
   * @brief   コマンド選択画面を開く
   */
  //------------------------------------------------------------------
  virtual void OpenCmdSelect( void ) { ; }
};

GFL_NAMESPACE_END(FinderMenu)
GFL_NAMESPACE_END(App)

#endif // __FINDER_MENU_DRAW_LISTENER_H__