//[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[
/**
 *	GAME FREAK inc.
 *
 *	@file		FieldActionCmdNone.h
 *	@brief		アクションコマンド　NONE
 *	@author		tomoya takahashi
 *	@date		2011.05.14
 *
 */
//]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]
#ifndef __FIELDACTIONCMDNONE_H__
#define __FIELDACTIONCMDNONE_H__

#include "FieldPawnTypes.h"
#include "FieldActionCmdBase.h"

namespace field{
namespace mmodel{

//-----------------------------------------------------------------------------
/**
 *					定数宣言
*/
//-----------------------------------------------------------------------------

//-----------------------------------------------------------------------------
/**
 *					構造体宣言
*/
//-----------------------------------------------------------------------------

//-----------------------------------------------------------------------------
/**
 *					クラス宣言
*/
//-----------------------------------------------------------------------------
class ActionCmdNone : public ActionCmdBase
{
public:
  // コンストラクタ
  ActionCmdNone(void){ m_SeqNum = 0; }

  // デストラクタ
  virtual ~ActionCmdNone(){}

  //----------------------------------------------------------------------------
  /**
   *	@brief  対応するアクションコマンドを返す
   *
   *	@return アクションコマンド
   */
  //-----------------------------------------------------------------------------
  virtual Acmd GetAcmdID( void ) const{ return AC_NONE; }

};

} // mmodel
} // field

#endif	// __FIELDACTIONCMDNONE_H__

