//============================================================================
/**
 *
 *	@file		FieldPawnTypes.h
 *	@brief  pawnから参照する定義
 *	@author hosaka genya
 *	@date		2011.09.26
 *
 * 将来の改善点
 * -定義内容のバリエーションがグローバルすぎるので分割を考えるべき
 *
 */
//============================================================================
#if !defined( __FIELDPAWNTYPES_H__ )
#define __FIELDPAWNTYPES_H__

//-------------------------------------
///	アクションコマンド
//=====================================
enum Acmd
{
  AC_NONE = 0,    // 何も動かないコマンド
  AC_WALK_32F,    // 指定方向に移動 32フレーム 
  AC_TSURI_TEST,  // 釣り(同期アニメーション)テスト
  AC_MAX,         // アクションコマンド最大数
};


enum SCRID
{
  SCRID_DUMMY = 2000,       ///< 仮定義
  SCRID_DEFAULT = -1,       ///< 無効なスクリプトID
  SCRID_NULL = 0,           ///< なし
};

//--------------------------------------------------------------
/// コールバックスクリプトのタイプ指定
//--------------------------------------------------------------
enum SCR_CALLBACK_TYPE
{
  SCR_CALLBACK_TYPE_NOTHING,        ///<存在しない

  SCR_CALLBACK_TYPE_TRAINER_AFTER,  ///<トレーナー戦後呼び出し

  SCR_CALLBACK_TYPE_NUM
};


#endif