#ifndef __GFL_THREAD_ADAPTER_H__
#define __GFL_THREAD_ADAPTER_H__
//=============================================================================
/**
 * @file	 gfl_thread_adapter.h
 * @brief	 このクラスを継承して機種依存実装を行うこと
 * @author k.ohno
 * @date	 2014.5.13
 */
//=============================================================================
#pragma once


//#include <stdio.h>
//#include <stdlib.h>
//#include <string.h>
//#include <thread>


GFL_NAMESPACE_BEGIN(gfl2)
GFL_NAMESPACE_BEGIN(thread)




class ThreadAdapter{
  GFL_FORBID_COPY_AND_ASSIGN(ThreadAdapter);

public:

  ThreadAdapter(void){};
  virtual ~ThreadAdapter(){};

  //-----------------------------------------------------------------------
  /**
   * @brief プライオリティーを取得する
   */
  //-----------------------------------------------------------------------
  virtual int GetPriority(void) = 0;
  //-----------------------------------------------------------------------
  /**
   * @brief プライオリティーを設定する 
   */
  //-----------------------------------------------------------------------
  virtual void SetPriority(int no) = 0;
  //-----------------------------------------------------------------------
  /**
   * @brief スレッドスタート
   * @param プライオリティー
   */
  //-----------------------------------------------------------------------
  virtual void Start(void) = 0;
  virtual void Start(int priority) = 0;
  //-----------------------------------------------------------------------
  /**
   * @brief スレッドが終わるまでブロックします
   */
  //-----------------------------------------------------------------------
  virtual void Wait(void) = 0;
  //-----------------------------------------------------------------------
  /**
   * @brief イールド 処理系に再スケジュールの機会を与える。
   */
  //-----------------------------------------------------------------------
  virtual void CurrentYield( void ) = 0;
  //-------------------------------------------------------------------------
  /**
   * @brief カレントスレッドを指定時間停止させる
   * @param milliSeconds スレッドを停止させる時間（ミリ秒）
   */
  //-------------------------------------------------------------------------
  virtual void CurrentSleep( s32 milliSeconds ) = 0;
  //-------------------------------------------------------------------------
  /**
   * @brief カレントスレッドを指定時間停止させる
   *
   * @param microSeconds スレッドを停止させる時間（マイクロ秒）
   */
  //-------------------------------------------------------------------------
  virtual void CurrentSleepMicro( s32 microSeconds ) = 0;
  //-------------------------------------------------------------------------
  /**
   * @brief   スレッドが終了したかどうか確認する
   * @return  終了していたらtrue
   */
  //-------------------------------------------------------------------------
  virtual bool IsAlive(void) = 0;
  //-------------------------------------------------------------------------
  /**
   * @brief スレッドを終了処理へいかせる。強制終了ではないのでIsAliveで確認すること。
   */
  //-------------------------------------------------------------------------
  virtual void Kill(void) = 0;

};





GFL_NAMESPACE_END(thread)
GFL_NAMESPACE_END(gfl2)

#endif __GFL_THREAD_ADAPTER_H__
