// ============================================================================
/*
 * @file JoinFestaSubScreenMainLowerInputListener.h
 * @brief ジョインフェスタ下画面のメイン画面の入力イベントを受け取るリスナーです。
 * @date 2015.09.01
 * @author ichiraku_katsuhiko
 */
// ============================================================================
#if !defined( JOINFESTASUBSCREEN_MAIN_LOWER_INPUTLISTENER_H_INCLUDE )
#define JOINFESTASUBSCREEN_MAIN_LOWER_INPUTLISTENER_H_INCLUDE
#pragma once

#include <macro/include/gfl2_macros.h>

GFL_NAMESPACE_BEGIN(NetApp)
GFL_NAMESPACE_BEGIN(JoinFestaSubScreen)
GFL_NAMESPACE_BEGIN(View)


class JoinFestaSubScreenMainLowerInputListener
{
public:

  //--------------------------------------------------------------------------
  /**
   * @brief   対戦ボタン通知
   */
  //--------------------------------------------------------------------------
  virtual void OnBattleButtonAction() = 0;

  //--------------------------------------------------------------------------
  /**
   * @brief   交換ボタン通知
   */
  //--------------------------------------------------------------------------
  virtual void OnTradeButtonAction() = 0;

  //--------------------------------------------------------------------------
  /**
   * @brief   ストリーミングメッセージタッチ通知
   */
  //--------------------------------------------------------------------------
  virtual void OnStreamMessageAction() = 0;

  //--------------------------------------------------------------------------
  /**
   * @brief   インターネットボタン通知
   */
  //--------------------------------------------------------------------------
  virtual void OnInternetButtonAction() = 0;

  //--------------------------------------------------------------------------
  /**
   * @brief   お知らせボタン通知
   */
  //--------------------------------------------------------------------------
  virtual void OnInfoButtonAction() = 0;

  //--------------------------------------------------------------------------
  /**
   * @brief   プレイヤーリストボタン通知
   */
  //--------------------------------------------------------------------------
  virtual void OnPlayerListButtonAction() = 0;

  //--------------------------------------------------------------------------
  /**
   * @brief   Myプロフィールボタン通知
   */
  //--------------------------------------------------------------------------
  virtual void OnMyProfileButtonAction() = 0;

  //--------------------------------------------------------------------------
  /**
   * @brief   ポケモンリストボタン通知
   */
  //--------------------------------------------------------------------------
  virtual void OnPokelistButtonAction() = 0;

  //--------------------------------------------------------------------------
  /**
   * @brief   バッグボタン通知
   */
  //--------------------------------------------------------------------------
  virtual void OnBagButtonAction() = 0;

  //--------------------------------------------------------------------------
  /**
   * @brief   戻るボタン通知
   */
  //--------------------------------------------------------------------------
  virtual void OnBackButtonAction() = 0;
};


GFL_NAMESPACE_END(View)
GFL_NAMESPACE_END(JoinFestaSubScreen)
GFL_NAMESPACE_END(NetApp)

#endif // JOINFESTASUBSCREEN_MAIN_LOWER_INPUTLISTENER_H_INCLUDE
